app/controllers/comments_controller.rb

  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "This is a first comment"], ["link_id", 3], ["user_id", 2], ["created_at", "2015-09-30 19:34:32.372387"], ["updated_at", "2015-09-30 19:34:32.372387"]]